---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.ReverseIterator
source: html/5327e841-342c-12e5-972c-98b0d6a1bf4b.htm
---
# Autodesk.Revit.DB.DetailCurveArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DetailCurveArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.